LongX37HS/stm32f103c8t6-/Hardware/Encoder.c
#include "stm32f10x.h"                  // Device header

void Encoder_Init(void){
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_ICInitTypeDef TIM_ICInitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);//左右电机编码器时钟接口
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);//左右电机编码器时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4,ENABLE);
	//TIM2
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_0|GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	//TIM4
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_6|GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	
	GPIO_Init(GPIOB,&GPIO_InitStructure);
	
	TIM_TimeBaseInitStructure.TIM_ClockDivision=TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode=TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period=65536-1;
	TIM_TimeBaseInitStructure.TIM_Prescaler=1-1;
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter=0;
	
	TIM_TimeBaseInit(TIM2,&TIM_TimeBaseInitStructure);
	TIM_TimeBaseInit(TIM4,&TIM_TimeBaseInitStructure);//两个时钟初始化
	
	TIM_ICStructInit(&TIM_ICInitStructure);
	TIM_ICInitStructure.TIM_Channel= TIM_Channel_1 ;
	TIM_ICInitStructure.TIM_ICFilter=0xF;
	
	TIM_ICInit(TIM2,&TIM_ICInitStructure);//输入捕获初始化
	TIM_ICInit(TIM4,&TIM_ICInitStructure);	
	
	TIM_ICStructInit(&TIM_ICInitStructure);
	TIM_ICInitStructure.TIM_Channel= TIM_Channel_2 ;
	TIM_ICInitStructure.TIM_ICFilter=0xF;
	
	TIM_ICInit(TIM2,&TIM_ICInitStructure);//输入捕获初始化
	TIM_ICInit(TIM4,&TIM_ICInitStructure);	
	
	TIM_EncoderInterfaceConfig(TIM2,TIM_EncoderMode_TI12,TIM_ICPolarity_Falling,TIM_ICPolarity_Rising);
	TIM_EncoderInterfaceConfig(TIM4,TIM_EncoderMode_TI12,TIM_ICPolarity_Rising,TIM_ICPolarity_Rising);	
	TIM_Cmd(TIM2,ENABLE);//使能
	TIM_Cmd(TIM4,ENABLE);	
}

int16_t Encoder_GetCounterL(void){
	uint16_t temp=0;
	temp=TIM_GetCounter(TIM2);
	TIM_SetCounter(TIM2,0);
	return temp;
	
}

int16_t Encoder_GetCounterR(void){
	uint16_t temp=0;
	temp=TIM_GetCounter(TIM4);
	TIM_SetCounter(TIM4,0);
	return temp;
}
